prak13/sticky/app/Http/Controllers/StoreController.php

select `id`, `name` from `users` where `users`.`id` in (1, 6, 13)
select count(*) as aggregate from `stores`
---
    public function list()
    {
        $stores = Store::query()
                ->with('user:id,name')
                ->withCount('products')
                ->latest()
                ->paginate(8);

update `stores` set `status` = 'active', `stores`.`updated_at` = '2024-12-22 14:43:46' where `id` = 5
---
    public function approve(Store $store)
    {
        $store->status = StoreStatus::ACTIVE;
        $store->save();

select * from `stores` where `user_id` = 13 order by `created_at` desc limit 8 offset 0
select count(*) as aggregate from `stores` where `user_id` = 13
---
    public function mine(Request $request)
    {
        $stores = Store::query()
                ->where('user_id', $request->user()->id)
                ->latest()
                ->paginate(8);

select * from `stores` where `status` = 'active' order by `created_at` desc
---
    public function index()
    {
        $stores = Store::query()
            ->where('status', StoreStatus::ACTIVE)
            ->latest()
            ->get();

insert into `stores` (`logo`, `name`, `description`, `user_id`, `slug`, `status`, `updated_at`, `created_at`) values ('images/stores/VvCiTgQa5GQtnki2Ib29UKQhIQFWRLlEuCVBDYcH.png', 'yeee', 'Rp. 5.000.000', 13, 'yeee', 'pending', '2024-12-22 14:35:48', '2024-12-22 14:35:48')
---
    public function store(StoreRequest $request)
    {
        $file = $request->file('logo');

         $request->user()->stores()->create([
            ...$request->validated(),
            ...['logo' => $file->store('images/stores')]
        ]);

select * from `products` where `products`.`store_id` = 2 and `products`.`store_id` is not null order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `products` where `products`.`store_id` = 2 and `products`.`store_id` is not null
---
    public function show(Store $store)
    {
        return view('stores.show', [
            'store' => $store->loadCount('products'),
            'products' => $store->products()->latest()->paginate(12),