prak12/sticky/app/Traits/HasRoles.php

    public function hasRole(string $role): bool{
        return $this->roles()->where('name', $role)->exists();
---
select exists(select * from `roles` inner join `user_roles` on `roles`.`id` = `user_roles`.`role_id` where `user_roles`.`user_id` = 2 and `name` = 'admin') as `exists`